Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: Com ja s'ha comentat en la pàgina , per a emmagatzemar textos s'usa el codi ASCII com a codi bàsic.
es_es: Cómo ya se ha comentado en la página , para almacenar textos se usa el código ASCII como código básico.

source: En la segona fase, anomenada de vegades serialització, els codis es converteixen en octets assignant-los una determinada seqüència de bits (per exemple: 97 $$ 01100001; 63 $$ 00111111).
es_es: En la segunda fase, denominada a veces serialización<\/y4>, los códigos se convierten en octetos asignándolos una determinada secuencia de bits (por ejemplo: 97 $$ 01100001<\/y7>; 63 $$ 00111111<\/y8>).

source: $$ {r} text esquerre segmentat
es_es: $$ {r} texto de la izquierda segmentado

source: El podem haver generat, potser a partir d'un altre text, usant un processador de textos (vegeu l'apartat ).
es_es: Lo podemos haber generado, quizás a partir de otro texto, usando un procesador de textos<\/y1> (ver apartado ).

source: Com veurem més avall, en comptes de traduir mot a mot fent una simple substitució de cada mot origen pel(s) mot(s) meta corresponents, les memòries de traducció fan substitucions de fragments de més d'un mot, i, en lloc d'usar un diccionari bilingüe, usen una base de dades de fragments de més d'un mot prèviament traduïts.
es_es: Cómo veremos más abajo, en vez de traducir palabra por palabra haciendo una simple sustitución de cada palabra origen por la(s) palabra(s) meta correspondientes, las memorias de traducción hacen sustituciones de fragmentos de más de una palabra, y, en lugar de usar un diccionario bilingüe, usan una base de datos de fragmentos de más de una palabra previamente traducidos.

source: Als sistemes de traducció automàtica directes o mot per mot.
es_es: A los sistemas de traducción automática directas o palabra por palabra.

source: La figura mostra un esquema del procés.
es_es: La figura muestra un esquema del proceso.

source: La situació és diferent quan s'estan traduïnt els missatges o textos inclosos en programes d'ordinador, com a part de les tasques anomenades genèricament de localització (adaptació de programes d'ordinador als usuaris d'una regió i idioma concrets); en aquest cas, pot molt útil en alguns casos veure tot el programa a més dels textos.
es_es: La situación es diferente cuando se están traduciendo los mensajes o textos incluidos en programas de ordenador, como parte de las tareas llamadas genéricamente de localización (adaptación de programas de ordenador a los usuarios de una región e idioma concretos); en este caso, puede muy útil en algunos casos ver todo el programa además de los textos.

source: La probabilitat que un fragment esquerre (procedent dels bitextos ja existents) $e$ aparega en un nou text $E'$ és tant més gran com més menut és el fragment.
es_es: La probabilidad que un fragmento izquierdo (procedente de los bitextos ya existentes) $i$ aparezca en un nuevo texto $I'$ es tanto más grande cuanto más pequeño es el fragmento.

source: Els mecanismes de segmentació usuals intenten identificar unitats similars a l'oració usant la puntuació i el format com a indicadors, amb la idea que el nombre d'oracions serà bàsicament el mateix en el text dret i l'esquerre (això pot fallar).
es_es: Los mecanismos de segmentación usuales intentan identificar unidades similares a la oración usando la puntuación y el formato como indicadores, con la idea que el número de oraciones será básicamente el mismo en el texto derecho y el izquierdo (esto puede fallar).

source: D'altra banda, els textos, a més de caràcters, contenen informació de format.
es_es: Por otro lado, los textos, además de caracteres, contienen información de formato.

source: on cada registre és una llengua i cada camp una unitat de traducció on cada registre és una oració i cada camp un mot on cada registre és una unitat de traducció i la variant en cada llengua es guarda en un camp diferent Quina característica dels textos que s'han de traduir fa que l'ús de memòries de traducció siga la solució adequada?
es_es: donde cada registro es una lengua y cada campo una unidad de traducción donde cada registro es una oración y cada campo una palabra donde cada registro es una unidad de traducción y la variante en cada lengua se guarda en un campo diferente Qué característica de los textos que se tienen que traducir hace que el uso de memorias de traducción sea la solución adecuada?

source: Quan es tracta de traduir documents de text, la persona usuària vol alinear text i en molts casos probablement no necessita veure els codis de format per a validar o corregir un alineament. A més, les unitats de traducció que se n'obtinguen de l'alineament haurien de ser independents del format del document.
es_es: Cuando se trata de traducir documentos de texto, la persona usuaria quiere alinear texto y en muchos casos probablemente no necesita ver los códigos de formato para validar o corregir un alineamiento. Además, las unidades de traducción que se obtengan del alineamiento tendrían que ser independientes del formato del documento.

source: Hi ha moltes maneres d'organitzar aquests octets per a emmagatzemar els textos.
es_es: Hay muchas maneras de organizar estos octetos para almacenar los textos.

source: Convé, a més, esmentar un altre aspecte addicional important.
es_es: Conviene, además, mencionar otro aspecto adicional importante.

source: Però és que, al contrari del que podria semblar, no és gens senzill distingir quan un punt representa el final d'una oració: [...] molt tard.
es_es: Pero es que, al contrario del que podría parecer, no es nada sencillo distinguir cuando un punto representa el final de una oración: [...] muy tarde.

source: El tipus de fitxer bàsic de treball del professional de la traducció sol ser un fitxer amb text, és a dir, un text informatitzat, també anomenat document de text.
es_es: El tipo de fichero básico de trabajo de un profesional de la traducción suele ser un fichero con texto, es decir, un texto informatizado, también llamado documento de texto<\/y0>.

source: Punts en mig de sigles: CC(.)OO., EE(.)UU., etc.
es_es: Puntos en medio de siglas: CC(.)OO., EE(.)UU., etc.

source: En agost de 1998 es va aprovar la versió 1.1 d'un format estàndard anomenat TMX (Translation Memory eXchange, ``intercanvi de memòries de traducció''); quasi tots els programes gestors de memòries de traducció poden escriure i llegir memòries en aquest format, que a l'abril del 2004 arribava a la versió 1.4b.
es_es: En agosto de 1998 se aprobó la versión 1.1 de un formato estándar llamado TMX (Translation Memory eXchange, ``intercambio de memorias de traducción''); casi todos los programes gestores de memorias de traducción pueden escribir y leer memorias en este formato, que en abril del 2004 llegaba a la versión 1.4b.

source: La utilitat d'una memòria de traducció depén en gran part de la capacitat del sistema per a proposar traduccions per a segments { similars} (i per a això s'han de definir i usar criteris adequats de similitud).
es_es: La utilidad de una memoria de traducción depende en gran parte de la capacidad del sistema para proponer traducciones para segmentos { similares} (y para lo cual se tienen que definir y usar criterios adecuados de similitud).

source: Doneu almenys quatre excepcions diferents a aquesta regla i descrigueu, en cada cas, una regla senzilla que permeta decidir amb seguretat raonable quan ens trobem en cada una d'aquestes excepcions, usant el mínim possible d'anàlisi lingüística del text.
es_es: Dáis al menos cuatro excepciones diferentes a esta regla y describáis, en cada caso, una regla sencilla que permita decidir con seguridad razonable cuando nos encontramos en cada una de estas excepciones, usando el mínimo posible de análisis lingüístico del texto.

source: Abans del cos, l'element arrel tmx conté una capçalera (header) amb informació sobre la creació i les característiques de la memòria.
es_es: Antes del cuerpo, el elemento raíz tmx contiene una cabecera (header) con información sobre la creación y las características de la memoria.+

source: De fet, quan dos textos $E$ i $D$ són equivalents (és a dir, traducció un de l'altre) direm que el parell $(E,D)$ és un bitext.
es_es: De hecho, cuando dos textos $I$ y $D$ son equivalentes (es decir, traducción uno del otro) diremos que el par $(I,D)$ es uno bitexto.

source: Passar-los a XML.
es_es: Pasarlos a XML.

source: Una memòria de traducció és una base de dades
es_es: Una memoria de traducción es una base de datos

source: Per sort, no.
es_es: Por suerte, no.

source: L'operació d'alineament de bitextos existents és una de les tasques que es pot realitzar amb l'ajuda d'un programa de memòries de traducció.
es_es: La operación de alineamiento de bitextos existentes es una de las tareas que se puede realizar con la ayuda de un programa de memorias de traducción.

source: Solució: si detectem [majúscula] ``.'' [majúscula] (sense blancs), no segmentem.
es_es: Solución: si detectamos [mayúscula] ``.'' [mayúscula] (sin blancos), no segmentamos.

source: Un document XML és vàlid{}
es_es: Un documento XML es válido{}

source: {Alguns exemples del codi ASCII.
es_es: {Algunos ejemplos del código ASCII.

source: El processador de textos aplica automàticament les mateixes característiques de presentació a tots els segments del document que tenen aquell mateix estil.
es_es: El procesador de textos aplica automáticamente las mismas características de presentación a todos los segmentos del documento que tienen aquel mismo estilo.

source: (un espai en blanc)
es_es: (un espacio en blanco)

source: On va el títol d'un document HTML (el que es mostra en la barra del navegador)?
es_es: ¿Dónde va el título de un documento HTML (el que se muestra en la barra del navegador)?

source: Com s'hi pot veure, les etiquetes que apareixen entre parèntesis angulars indiquen les diverses parts del document, anomenades elements.
es_es: Como se puede ver, las etiquetas que aparecen entre paréntesis angulares indican las diversas partes del documento, denominadas elementos.

source: El full d'estil CSS pot estar en el mateix fitxer que el document HTML o XML o en un fitxer extern.
es_es: La hoja de estilo CSS puede estar en el mismo fichero que el documento HTML o XML o en un fichero externo.

source: La figura mostra part d'un document RTF, en la qual es veuen algunes comandes de l'encapçalament (començant amb ``+{rtf1+...'') i on també s'observa la manera especial com es codifiquen alguns caràcters.
es_es: La figura muestra parte de un documento RTF, en la cual se ven algunos pedidos del encabezamiento (empezando con ``+{rtf1+...'') y donde también se observa la manera especial en que se codifican algunos caracteres.

source: En els caràcters assignats als codis del 0 al 127.
es_es: En los caracteres asignados a los códigos del 0 al 127.

source: Què es conserva d'ASCII en els sistemes de codificació de caràcters més avançats com Unicode, UTF-8, ISO-8859-1, etc.?
es_es: ¿Qué se conserva de ASCII en los sistemas de codificación de caracteres más avanzados como Unicode, UTF-8, ISO-8859-1, etc.?

source: 1000 exactament, 1 per caràcter 2000 exactament, 2 per caràcter entre 1000 i 2000, entre 1 octet i 2 octets per caràcter En XML, si s'obri un element amb la marca |<frase>|, amb quina marca es tanca?
es_es: 1000 exactamente, 1 por carácter 2000 exactamente, 2 por carácter entre 1000 y 2000, entre 1 octeto y 2 octetos por carácter En XML, si se abre un elemento con la marca |<frase>|, ¿con qué marca se cierra?

source: Forcada</NOM> <NUM>+34-96-590-9326</NUM> </DESTINATARI> <REMITENT> <NOM>Letícia Ibaizábal</NOM> <NUM>+34-96-999-9999</NUM> </REMITENT> <DATA>23 de setembre de 2000</DATA> <TEXT> <P>Mikel, m'agradaria que m'enviares el text de l'última pràctica d'IAT.</P> <P>Ah, i també; l'examen de febrer.
es_es: Forcada</NOM> <NUM>+34-96-590-9326</NUM> </DESTINATARI> <REMITENT> <NOM>Letícia Ibaizábal</NOM> <NUM>+34-96-999-9999</NUM> </REMITENT> <DATA>23 de septiembre de 2000</DATA> <TEXT> <P>Mikel, me gustaría que me enviaras el texto de la última práctica de IAT.</P> <P>Ah, y también; el examen de febrero.

source: (recordeu que en català oriental aquests mots es pronuncien idènticament)
es_es: (recordad que en catalán oriental estas palabras se pronuncian idénticamente)

source: Un dels tipus més senzills de fulls d'estil són els anomenats fulls d'estil en cascada.} (CSS, cascaded style sheets) que s'usen sobre tot amb navegadors i HTML, encara que també es poden usar per a presentar XML directament en els navegadors.
es_es: Uno de los tipos más sencillos de hojas de estilo son los llamados hojas de estilo en cascada.} (CSS, cascaded style sheets) que se usan sobre todo con navegadores y HTML, aunque también se pueden usar para presentar XML directamente en los navegadores.

source: Introducció''), però en la llengua d'arribada els termes nous van en negretes (``Un octet és ...''), se sagna la primera línia de tots els paràgrafs excepte la del primer paràgraf d'una secció, i els números de secció no porten punt al final (``1.1 Introducció'').
es_es: Introducción''), pero en la lengua de llegada los términos nuevos van en negritas (``Un byte es ...''), se sangra la primera línea de todos los párrafos excepto la del primer párrafo de una sección, y los números de sección no llevan punto al final (``1.1 Introducción'').

source: El document conté només un element arrel que conté tots els elements del text.
es_es: El documento contiene sólo un elemento raíz que contiene todos los elementos del texto.

source: Com s'indica en una DTD que l'element |<fitxa>| conté obligatòriament els camps |<nom>| i |<tel>| i, opcionalment, el camp |<email>|?
es_es: ¿Cómo se indica en una DTD que el elemento |<fitxa>| contiene obligatoriamente los campos |<nom>| y | <tel>| y, opcionalmente, el campo |<email>|?

source: Operacions amb tipus de lletra: selecccionar la grandària de la lletra (per exemple, en punts, 1 polzada = 2,54 cm = 72 punts) seleccionar la família tipogràfica (Times, Courier, Helvetica...) seleccionar l'estil de la lletra: redona, cursiva, negreta, subíndex, superíndex, etc.
es_es: Operaciones con tipos de letra: selecccionar el tamaño de la letra (por ejemplo, en puntos, 1 pulgada = 2,54 cm = 72 puntos) seleccionar la familia tipográfica (Times, Courier, Helvetica...) seleccionar el estilo de la letra: redonda, cursiva, negrita, subíndice, superíndice, etc.

source: Encapçalament de nivell 2
es_es: Encabezamiento de nivel 2

source: De qualsevol manera, ASCII i ANSI s'usen en aplicacions com ara el correu electrònic, o quan volem que un text ---el contingut del qual és molt més important que l'aparença--- puga ser llegit per qualsevol usuari sense importar el processador de textos que use; els textos d'aquesta mena s'anomenen de vegades textos plans i s'emmagatzemen normalment en fitxers amb noms que tenen l'extensió .txt.
es_es: De cualquier manera, ASCII y ANSI se usan en aplicaciones como por ejemplo el correo electrónico, o cuando queremos que un texto ---el contenido del cual es mucho más importante que la apariencia--- pueda ser leído por cualquier usuario sin importar el procesador de textos que use; los textos de este tipo se denominan a veces textos planos y se almacenan normalmente en ficheros con nombres que tienen la extensión .txt.

source: Com en el cas del reconeixement de la parla, és crucial l'ús d'informació sobre l'idioma concret (diccionaris, estadística sobre les seqüencies de lletres) per a corregir els errors de l'OCR.
es_es: Cómo en el caso del reconocimiento del habla, es crucial el uso de información sobre el idioma concreto (diccionarios, estadística sobre las secuencias de letras) para corregir los errores del OCR.

source: En el cas dels fulls d'estil CSS, l'esquema d'ús és el que s'indica en la figura : el navegador llig el document HTML o XML, hi aplica els estils del full CSS, i genera una presentació.
es_es: En el caso de las hojas de estilo CSS, el esquema de uso es el que se indica en la figura : el navegador lee el documento HTML o XML, aplica los estilos de la hoja CSS, y genera una presentación.

source: Què fa que el següent fragment de XML estiga mal format?
es_es: ¿Qué hace que el siguiente fragmento de XML esté mal formado?

source: Si en una DTD trobem les regles següents és vàlida d'acord amb aquesta DTD?
es_es: Si en una DTD encontramos las reglas siguientes ¿es válida de acuerdo con esta DTD?

source: A la seua directora no li agraden així i li'ls ha fet canviar a Lucida Sans de 14, negreta i Lucida de 12, negreta sense cursives.
es_es: A su directora no le gustan así y se los ha hecho cambiar a Lucida Sans de 14, negrita y Lucida de 12, negrita sin cursivas.

source: 11, independentment de la codificació.
es_es: 11, independientemente de la codificación.

source: Fins i tot fitxers que normalment no consideraríem documents, com ara les memòries de traducció (vegeu el capítol ) s'estructuren de manera estàndard usant un format basat en XML anomenat TMX.
es_es: Incluso ficheros que normalmente no consideraríamos documentos, como por ejemplo las memorias de traducción (ved el capítulo ) se estructuran de manera estándar usando un formato basado en XML llamado TMX.

source: No s'hi pot assignar presentació.
es_es: No se puede asignar presentación.

source: Idealment, hauria d'acabar amb una marca de final de paràgraf.
es_es: Idealmente, tendría que acabar con una marca de final de párrafo.

source: El DESTINATARI del fax té dues parts: el NOM (opcional) i el número (NUM).
es_es: El DESTINATARIO del fax tiene dos partes: el NOMBRE (opcional) y el número (NUM).

source: Sí, perquè cada llengua usa els caràcters de manera diferent per a formar paraules.
es_es: Sí, porque cada lengua usa los caracteres de manera diferente para formar palabras.

source: Un mes aproximadament.
es_es: Un mes aproximadamente.

source: {rcl} document XML
es_es: {rcl} documento XML

source: Això resoldria les situacions problemàtiques explicades més amunt.
es_es: Esto resolvería las situaciones problemáticas explicadas más arriba.

source: XML és {}
es_es: XML es {}

source: Imaginem les següents situacions problemàtiques: Vladimir ha decidit que els títols de secció de l'informe anual que li han encarregat estaran en Helvetica de 14 punts, negreta i els de subsecció en Arial de 12 punts, negreta cursiva.
es_es: Imaginaos la siguiente situación problemática: Vladimir ha decidido que los títulos de sección del informe anual que le han encargado estarán en Helvetica de 14 puntos, negrita y los de subsección en Arial de 12 puntos, negrita cursiva.

source: Amb una codificació de caràcters (p.e., Unicode o ISO-8859-1).
es_es: Con una codificación de caracteres (p.e., Unicode o ISO-8859-1).

source: Els caràcters < i no poden aparéixer en el text dels elements ni dels atributs (si es necessiten aquests caràcters s'han d'escriure lt; i amp;).
es_es: Los caracteres < y no pueden aparecer en el texto de los elementos ni de los atributos (si se necesitan estos caracteres se tienen que escribir lt; y amp; ).

source: Aquestes són algunes de les característiques que fan que un document XML estiga ben format, és a dir, siga un document XML i no una altra cosa: Cada etiqueta d'inici d'element de la forma <nom>, <nom atribut=valor >, <nom atribut=valor atribut=valor >, etc.
es_es: Estas son algunas de las características que hacen que un documento XML esté bien formado, es decir, sea un documento XML y no otra cosa: Cada etiqueta de inicio de elemento de la forma <nombre>, <nombre atributo=valor >, <nombre atributo=valor atributo=valor >, etc.

source: El reconeixement automàtic de textos escrits (RATE) es pot definir com la producció de textos informatitzats a partir de textos manuscrits o tipografiats.
es_es: El reconocimiento automático de textos escritos (RATE) se puede definir como la producción de textos informatizados a partir de textos manuscritos o tipografiados.

source: <p>Aquest és l'<em>últim</em> paràgraf d'aquest document HTML.
es_es: <p>Este es el <em>último</em> párrafo de este documento HTML.

source: Com que l'informe ha d'estar acabat per a demà de matí, Vladimir es queda a l'oficina fins a les 11 de la nit, canviant un a un els tipus de lletra del títols de seccions i subseccions.
es_es: Dado que el informe tiene que estar acabado para mañana por la mañana, Vladimir se queda en la oficina hasta las 11 de la noche, cambiando uno a uno los tipos de letra del títulos de secciones y subsecciones.

source: En el primer problema, si s'hagueren usat els estils com s'indica, la numeració i l'estil de les seccions es determinaria automàticament i només caldria indicar (només una vegada) quin tipus de lletra correspon als títols de secció; a més és renumerarien automàticament totes les seccions.
es_es: En el primer problema, si se hubieran usado los estilos como se indica, la numeración y el estilo de las secciones se determinaría automáticamente y sólo habría que indicar (sólo una vez) qué tipo de letra corresponde a los títulos de sección; además se renumerarían automáticamente todas las secciones.

source: Un format obert d'intercanvi de memòries de traducció.
es_es: Un formato abierto de intercambio de memorias de traducción.

source: No pot, perquè és impossible que comprenga l'espanyol parlat.
es_es: No puede, porque es imposible que comprenda el español hablado.

source: És un fet ben establert que, per a superar aquestes dificultats, els humans fem un ús molt intensiu dels coneixements lingüístics que tenim sobre l'idioma que estem escoltant i del context comunicatiu: així, si sentim dir ``percà nom passes l'antre xoc de craus'' a un amic quan veiem que no pot obrir el cotxe, entenem perfectament què ens vol dir; o si sentim dir en veu alta ``mu han dim moltis baltes'' és molt probable que entenguem clarament ``m'ho han dit moltes voltes'' a pesar dels canvis fonètics, ja que inconscientment busquem la interpretació correcta més propera al que hem sentit (en el context concret en què es diu la frase).; un altre doblet el formen les expressions sax and violins on TV i la més versemblant sex and violence on TV} Els resultats de la RAP són especialment dependents de les particularitats lingüístiques de la llengua involucrada i l'èxit depén de l'existència d'un bon model de llengua ---ràpid i concís, és a dir, computacionalment eficient--- que simule la part no contextual de la comprensió humana i permeta obtenir el text més probable en un idioma determinat a partir del text en brut produït pel sistema de RAP.
es_es: Es un hecho muy establecido que, para superar estas dificultades, los humanos hacemos un uso muy intensivo de los conocimientos lingüísticos que tenemos sobre el idioma que estamos escuchando y del contexto comunicativo: así, si escuchamos decir en catalán ``percà nom passes l'antre xoc de craus'' a un amigo cuando vemos que no puede abrir el coche, entendemos perfectamente qué nos quiere decir; o si escuchamos decir en voz alta ``mu han dim moltis baltes'' es muy probable que entendamos claramente ``me lo han dicho muchas veces'' a pesar de los cambios fonéticos, puesto que inconscientemente buscamos la interpretación correcta más cercana a lo que hemos escuchado (en el contexto concreto en el que se enuncia la frase).; otro doblete lo forman las expresiones sax and violines on TV y la más verosímil sex and violence on TV} Los resultados del RAH son especialmente dependientes de las particularidades lingüísticas de la lengua involucrada y el éxito depende de la existencia de un buen modelo de lengua ---rápido y conciso, es decir, computacionalmente eficiente--- que simule la parte no contextual de la comprensión humana y permita obtener el texto más probable en un idioma determinado a partir del texto en bruto producido por el sistema de RAH.

source: (espai no trencable)
es_es: (espacio no rompible)
